{"keras_version": "2.1.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"name": "conv1d_1", "kernel_size": [50], "batch_input_shape": [null, 100, 5], "use_bias": true, "dilation_rate": [1], "activation": "relu", "strides": [3], "activity_regularizer": null, "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "kernel_size": [5], "use_bias": true, "dilation_rate": [1], "activation": "relu", "strides": [1], "activity_regularizer": null, "padding": "valid", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [2], "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "kernel_size": [5], "use_bias": true, "dilation_rate": [1], "activation": "relu", "strides": [2], "activity_regularizer": null, "padding": "valid", "filters": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "strides": [2], "padding": "valid", "pool_size": [2], "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 1500}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 1500}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_3", "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}