{"backend": "tensorflow", "config": [{"config": {"kernel_size": [50], "activation": "relu", "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "filters": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 100, 5], "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_regularizer": null, "name": "conv1d_1", "strides": [3]}, "class_name": "Conv1D"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5], "activation": "relu", "padding": "valid", "filters": 256, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv1d_2", "strides": [1]}, "class_name": "Conv1D"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_2", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "padding": "valid", "pool_size": [2], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"kernel_size": [5], "activation": "relu", "padding": "valid", "filters": 300, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv1d_3", "strides": [2]}, "class_name": "Conv1D"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_3", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "max_pooling1d_2", "trainable": true, "padding": "valid", "pool_size": [2], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"kernel_size": [3], "activation": "relu", "padding": "valid", "filters": 512, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv1d_4", "strides": [1]}, "class_name": "Conv1D"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_4", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 1500, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_5", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 1500, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_6", "scale": true, "gamma_constraint": null, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_6", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 3, "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.2", "class_name": "Sequential"}