{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [3], "use_bias": true, "kernel_constraint": null, "name": "conv1d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1], "trainable": true, "bias_regularizer": null, "padding": "same", "kernel_size": [50], "filters": 128, "bias_constraint": null, "batch_input_shape": [null, 100, 5], "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1], "use_bias": true, "kernel_constraint": null, "name": "conv1d_2", "trainable": true, "dilation_rate": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "valid", "activation": "relu", "kernel_size": [5], "filters": 256, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "strides": [2], "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [2], "use_bias": true, "kernel_constraint": null, "name": "conv1d_3", "trainable": true, "dilation_rate": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "valid", "activation": "relu", "kernel_size": [5], "filters": 300, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_2", "padding": "valid", "trainable": true, "strides": [2], "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "units": 1500, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "units": 1500, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "center": true, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_3", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "units": 3, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}