{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"strides": [3], "trainable": true, "dtype": "float32", "bias_regularizer": null, "filters": 128, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "batch_input_shape": [null, 100, 5], "activation": "relu", "name": "conv1d_1", "kernel_regularizer": null, "kernel_size": [50], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.2}}, {"class_name": "Conv1D", "config": {"strides": [1], "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activation": "relu", "name": "conv1d_2", "kernel_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_size": [5], "bias_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.2}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "name": "max_pooling1d_1", "trainable": true, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"strides": [2], "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activation": "relu", "name": "conv1d_3", "kernel_regularizer": null, "filters": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_size": [5], "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "name": "max_pooling1d_2", "trainable": true, "padding": "valid"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 1500, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 1500, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "noise_shape": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 3, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}