{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "dtype": "float32", "activation": "relu", "padding": "same", "use_bias": true, "dilation_rate": [1], "strides": [3], "bias_regularizer": null, "batch_input_shape": [null, 100, 5], "filters": 128, "kernel_constraint": null, "kernel_size": [50], "name": "conv1d_1", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "use_bias": true, "dilation_rate": [1], "strides": [1], "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_size": [5], "name": "conv1d_2", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "strides": [2], "padding": "valid", "name": "max_pooling1d_1", "trainable": true}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "use_bias": true, "dilation_rate": [1], "strides": [2], "bias_regularizer": null, "filters": 300, "kernel_constraint": null, "kernel_size": [5], "name": "conv1d_3", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "strides": [2], "padding": "valid", "name": "max_pooling1d_2", "trainable": true}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "relu", "padding": "valid", "use_bias": true, "dilation_rate": [1], "strides": [1], "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "kernel_size": [3], "name": "conv1d_4", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_4", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "bias_regularizer": null, "units": 1500, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_5", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "bias_regularizer": null, "units": 1500, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_6", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "bias_regularizer": null, "units": 3, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}