{"config": [{"config": {"batch_input_shape": [null, 100, 5], "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "padding": "same", "name": "conv1d_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [50], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [3], "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1], "filters": 128}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1], "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "name": "conv1d_2", "trainable": true, "bias_constraint": null, "filters": 256, "kernel_size": [5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "pool_size": [2], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"dilation_rate": [1], "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "name": "conv1d_3", "trainable": true, "bias_constraint": null, "filters": 300, "kernel_size": [5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "strides": [2]}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_3", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "max_pooling1d_2", "padding": "valid", "trainable": true, "pool_size": [2], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"dilation_rate": [1], "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "name": "conv1d_4", "trainable": true, "bias_constraint": null, "filters": 512, "kernel_size": [3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_4", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "units": 1500, "use_bias": true, "bias_regularizer": null, "activation": "linear", "name": "dense_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_5", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "units": 1500, "use_bias": true, "bias_regularizer": null, "activation": "linear", "name": "dense_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_6", "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "units": 3, "use_bias": true, "bias_regularizer": null, "activation": "linear", "name": "dense_3", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2"}