{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 100, 5], "bias_constraint": null, "dtype": "float32", "name": "conv1d_1", "dilation_rate": [1], "activity_regularizer": null, "trainable": true, "filters": 128, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_size": [50], "kernel_regularizer": null, "padding": "same", "strides": [3]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1], "bias_constraint": null, "name": "conv1d_2", "activity_regularizer": null, "trainable": true, "filters": 256, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_size": [5], "kernel_regularizer": null, "padding": "valid", "strides": [1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.2, "noise_shape": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_1", "pool_size": [2], "strides": [2]}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1], "bias_constraint": null, "name": "conv1d_3", "activity_regularizer": null, "trainable": true, "filters": 300, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_size": [5], "kernel_regularizer": null, "padding": "valid", "strides": [2]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_2", "pool_size": [2], "strides": [2]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1500}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1500}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_4", "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "keras_version": "2.1.2"}