{"keras_version": "2.1.2", "config": [{"config": {"kernel_constraint": null, "strides": [3], "padding": "same", "dtype": "float32", "batch_input_shape": [null, 100, 5], "kernel_size": [50], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_size": [5], "kernel_constraint": null, "strides": [1], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "filters": 256, "use_bias": true, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"kernel_size": [5], "kernel_constraint": null, "strides": [2], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "filters": 300, "use_bias": true, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "max_pooling1d_2", "strides": [2], "pool_size": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 1500, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 1500, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "trainable": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 3, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}